{
  "data": {
    "title": {
      "portfolio": "Portafolio"
    }
  },
  "navbar": {
    "fullstack": "Desarrollador Fullstack",
    "home": "Inicio",
    "about": "Sobre mí",
    "projects": "Proyectos",
    "certificates": "Certificados",
    "cv_download": {
      "name": "Descargar CV",
      "pdf": "Formato PDF",
      "docx": "Formato DOCX",
      "txt": "Formato TXT"

    },
    "perfil": "Perfiles",
    "contact": "Contacto"
  },
  "home": {
    "paragraph_1": "¡Hola!, soy Hans López, un desarrollador full-stack con especialización en JavaScript (Node.js).",
    "paragraph_2": "Mi experiencia abarca una amplia gama de aplicaciones y proyectos, desde el desarrollo front-end hasta la creación de modelos de lenguaje supervisados en el ámbito de la inteligencia artificial. Sin embargo, mi principal especialización está en el desarrollo backend y la creación de APIs.",
    "button": "siguiente"
  },
  "about": {
    "jobs": [
      {
        "title": "ACTIONHUB - BANCOESTADO",
        "works": [
          {
            "date": "Agosto 2023 - Diciembre 2023",
            "title": "Desarrollador Fullstack",
            "description": "Trabajé en el desarrollo de una API integradora en el equipo de postventa durante 5 meses. El equipo utilizaba Salesforce y se enfocaba en la creación de APIs/Microservicios bajo la metodología Scrum. Mi principal responsabilidad fue desarrollar la API Integradora y varias APIs/Microservicios usando Node.js y Express. También trabajé con tecnologías como MongoDB, Lightning Web Components y clases Apex de Salesforce.",
            "tags": [
              "JavaScript",
              "Node.js",
              "Express",
              "MongoDB",
              "Salesforce",
              "Scrum"
            ]
          }
        ]
      },
      {
        "title": "DUOC UC",
        "works": [
          {
            "date": "2023 - 2024",
            "title": "Desarrollador Fullstack",
            "description": "Lideré la creación de un sistema de chatbot escalable para mejorar la respuesta a consultas estudiantiles. Implementado con inteligencia artificial, el sistema facilita la interacción en lenguaje natural, optimizando la logística y resolución de problemas. Utilicé tecnologías como NestJS, PostgreSQL, Angular, Django y TensorFlow para el procesamiento de lenguaje natural.",
            "tags": [
              "NestJS",
              "PostgreSQL",
              "Angular",
              "Django",
              "TensorFlow"
            ]
          },
          {
            "date": "2022",
            "title": "Desarrollador Fullstack",
            "description": "Lideré un proyecto de gestión de alumnos y actividades para el Centro de Innovación y Transferencia Tecnológica. Utilizando la metodología Scrum, optimicé la colaboración y eficiencia del equipo. Empleé NestJS y MongoDB para el backend y Vue.js para el frontend.",
            "tags": [
              "Scrum",
              "NestJS",
              "MongoDB",
              "Vue.js"
            ]
          },
          {
            "date": "2020 - 2023",
            "title": "Profesor Asistente",
            "description": "Durante tres años, impartí conocimientos en SQL, PL/SQL, Python y Java. También ofrecí asesoramiento técnico integral en estos lenguajes y otros como JavaScript.",
            "tags": [
              "SQL",
              "PL/SQL",
              "Python",
              "Java",
              "JavaScript"
            ]
          }
        ]
      },
      {
        "title": "BILBAO LABS",
        "works": [
          {
            "date": "2021 - 2022",
            "title": "Desarrollador Fullstack",
            "description": "Desarrollé y optimicé sitios web utilizando PHP, Bootstrap y JavaScript. Me enfoqué en reforzar la seguridad digital, trabajar en equipos multidisciplinarios, introducir funcionalidades innovadoras y resolver problemas para mantener los sitios web actualizados.",
            "tags": [
              "PHP",
              "Bootstrap",
              "JavaScript",
              "jQuery",
              "MySQL",
              "Scrum",
              "HTML",
              "CSS"
            ]
          }
        ]
      },
      {
        "title": "FREELANCER",
        "works": [
          {
            "date": "2017 - 2019",
            "title": "Desarrollador Fullstack",
            "description": "Desarrollé bots personalizados para Discord con funcionalidades avanzadas como sistemas de permisos, gestión de música, administración de usuarios y registro de actividades, mejorando significativamente la experiencia de las comunidades.",
            "tags": [
              "Node.js",
              "MySQL",
              "Angular",
              "Electron.js",
              "HTML",
              "CSS",
              "Bootstrap"
            ]
          },
          {
            "date": "2017 - 2019",
            "title": "Desarrollador Fullstack",
            "description": "Desarrollé sitios web estáticos y dinámicos utilizando tecnologías como Angular, Express, NestJS, Django y Bootstrap. También creé aplicaciones con Django e interfaces intuitivas con Bootstrap, asegurando una óptima experiencia de usuario y diseño atractivo.",
            "tags": [
              "Angular",
              "HTML",
              "CSS",
              "Bootstrap",
              "JavaScript",
              "Django",
              "MySQL"
            ]
          }
        ]
      }
    ],
    "profile": {
      "about": "Acerca de mí",
      "text": {
        "paragraph_1": "💻 Soy un desarrollador Full Stack con una sólida experiencia en el desarrollo de aplicaciones web y backend. Me especializo en tecnologías como Express, Angular y MongoDB, y estoy graduado como Analista Programador e Ingeniero en Informática.",
        "paragraph_2": "Poseo habilidades avanzadas en el modelado de bases de datos tanto relacionales como no relacionales, desarrollo de API RESTful y frontend. He completado proyectos exitosos como freelancer y he brindado asesoramiento técnico como Profesor Asistente en Duoc UC, destacándome por mi capacidad para resolver problemas complejos."
      },
      "programming": {
        "programmingLanguages": "Lenguajes de programación",
        "databases": "Bases de datos",
        "technologiesTools": "Herramientas y tecnologías",
        "methodologies": "Metodologías",
        "cloudTechnologies": "Tecnologías en la nube"
      },
      "libraries": "Librerías y Frameworks"
    }
  },
  "projects": {
    "github": {
      "title": "Proyectos de Github"
    },
    "others": {
      "title": "Proyectos Recientes Publicados",
      "projects": [
        {
          "name": "Carbon Flama",
          "html_url": "https://carbonflama.cl",
          "description": "Sitio web creado para la venta de carbón por mayor, actualmente se encuentra en construcción.\n",
          "image": "carbon-flama.png"
        }
      ]
    }
  },
  "certificates": {
    "badges": {
      "title": "Mis Emblemas"
    },
    "certificates":{
      "title":"Mis Certificaciones"
    },
    "view_more":"Ver mas"
  },
  "settings": {
    "theme": {
      "default": "Claro",
      "dark": "Oscuro"
    },
    "language": {
      "title": "Idioma Cambiado",
      "description": "El idioma ha sido cambiado exitosamente"
    }
  }
}