{
  "data":{
    "title":{
      "portfolio":"Portafolio"
    }
  },
  "navbar": {
    "fullstack": "Desarrollador Fullstack",
    "home": "Inicio",
    "about": "Sobre m铆",
    "projects": "Proyectos",
    "cv_download": {
      "name": "Descargar CV",
      "pdf": "Formato PDF",
      "docx": "Formato DOCX"
    },
    "perfil": "Perfiles",
    "contact": "Contacto"
  },
  "home":{
    "paragraph_1":"隆Hola!, soy Hans L贸pez, un desarrollador full-stack con especializaci贸n en JavaScript (Node.js).",
    "paragraph_2":"Mi experiencia abarca una amplia gama de aplicaciones y proyectos, desde el desarrollo front-end hasta la creaci贸n de modelos de lenguaje supervisados en el 谩mbito de la inteligencia artificial. Sin embargo, mi principal especializaci贸n est谩 en el desarrollo backend y la creaci贸n de APIs.",
    "button":"siguiente"
  },
  "about": {
    "jobs": [
      {
        "title": "ACTIONHUB - BANCOESTADO",
        "works": [
          {
            "date": "Agosto 2023 - Diciembre 2023",
            "title": "Desarrollador Fullstack",
            "description": "Fui contratado para trabajar directamente en el desarrollo de una API integradora en el equipo de postventa con una duraci贸n de 5 meses. El equipo est谩 especializado en el uso de Salesforce y creaci贸n de APIs/Microservicios bajo la metodolog铆a Scrum. Mi enfoque principal consisti贸 en la creaci贸n y desarrollo del API Integradora, as铆 como en la elaboraci贸n de varias APIs/Microservicios mediante el uso de Node.js y Express. Adem谩s, trabaj茅 con tecnolog铆as como MongoDB, Lightning Web Components y clases Apex de Salesforce.",
            "tags": [
              "Javascript",
              "Node.js",
              "Express",
              "MongoDB",
              "Salesforce",
              "Scrum"
            ]
          }
        ]
      },
      {
        "title": "DUOC UC",
        "works": [
          {
            "date": "2023 - 2024",
            "title": "Desarrollador Fullstack",
            "description": "Lider茅 la creaci贸n de un sistema de chatbot escalable para abordar la falta de un m茅todo efectivo de respuesta a consultas estudiantiles. Este sistema, implementado con inteligencia artificial, facilita la interacci贸n en lenguaje natural, optimizando la log铆stica y la resoluci贸n de problemas. Las tecnolog铆as clave empleadas incluyen NestJS, PostgreSQL, Angular, Django y procesamiento de lenguaje natural con TensorFlow.",
            "tags": [
              "NestJS",
              "Progrestql",
              "Angular",
              "Django",
              "TensorFlow"
            ]
          },
          {
            "date": "2022 - 2022",
            "title": "Desarrollador Fullstack",
            "description": "Lider茅 un proyecto de gesti贸n de alumnos y actividades para el Centro de Innovaci贸n y Transferencia Tecnol贸gica. Este proyecto se destac贸 por la implementaci贸n de la metodolog铆a Scrum, optimizando la colaboraci贸n y eficiencia del equipo. Utilic茅 NestJS y MongoDB para el backend, asegurando una gesti贸n de datos robusta y escalable, mientras que para el frontend, apliqu茅 Vue.js.",
            "tags": [
              "Scrum",
              "NestJS",
              "MongoDB",
              "Vue.js"
            ]
          },
          {
            "date": "2020 - 2023",
            "title": "Profesor asistente",
            "description": "Durante tres a帽os, desempe帽茅 el rol de Profesor Asistente, impartiendo conocimientos en SQL, PL/SQL, Python y Java. En este per铆odo, tambi茅n proporcion茅 asesoramiento t茅cnico integral, abarcando dichos lenguajes de programaci贸n y extendiendo mi expertise a otros como JavaScript.",
            "tags": [
              "SQL",
              "PL/SQL",
              "Python",
              "Java",
              "JavaScript"
            ]
          }
        ]
      },
      {
        "title": "BILBAO LABS",
        "works": [
          {
            "date": "2021 - 2022",
            "title": "Desarrollador Fullstack",
            "description": "Fui responsable del desarrollo y optimizaci贸n de sitios web, empleando tecnolog铆as como PHP, Bootstrap y JavaScript. Mi enfoque se centr贸 en reforzar la seguridad digital, trabajar de manera colaborativa en equipos multidisciplinarios, introducir innovadoras funcionalidades, y asegurar la resoluci贸n eficiente de problemas para mantener los sitios web al d铆a con las 煤ltimas tendencias y actualizaciones.",
            "tags": [
              "PHP",
              "Bootstrap",
              "JavaScript",
              "JQuery",
              "Mysql",
              "Scrum",
              "HTML",
              "CSS"
            ]
          }
        ]
      },
      {
        "title": "FREELANCER",
        "works": [
          {
            "date": "2017 - 2019",
            "title": "Desarrollador Fullstack",
            "description": "Desarroll茅 bots altamente personalizados para Discord, que ofrec铆an funcionalidades avanzadas tales como sistemas de permisos, gesti贸n de m煤sica, administraci贸n de usuarios y un registro detallado de actividades. Estos bots mejoraron significativamente la experiencia de las comunidades.",
            "tags": [
              "Node.js",
              "Mysql",
              "Angular",
              "Electron.js",
              "HTML",
              "CSS",
              "Bootstrap"
            ]
          },
          {
            "date": "2017 - 2019",
            "title": "Desarrollador Fullstack",
            "description": "Desarroll茅 sitios web tanto est谩ticos y din谩micos, aplicando tecnolog铆as como Angular, Express, NestJS, Django y Bootstrap. Ademas del desarrollo de aplicaciones utilizando Django y la implementaci贸n de interfaces intuitivas con Bootstrap, asegurando una experiencia de usuario 贸ptima y un dise帽o atractivo.",
            "tags": [
              "Angular",
              "HTML",
              "CSS",
              "Bootstrap",
              "JavaScript",
              "Django",
              "Mysql"
            ]
          }
        ]
      }
    ],
    "profile": {
      "about": "Acerca de m铆",
      "text": {
        "paragraph_1": " Soy un desarrollador Full Stack con experiencia en aplicaciones web y backend, especializado en tecnolog铆as como Express, Angular y MongoDB. Graduado como Analista Programador e Ingenier铆o en Inform谩tica.\n",
        "paragraph_2": " Con habilidades en modelamiento de bases de datos relacionales y no relacionales, API RESTful y frontend, he entregado proyectos exitosos como Freelance y brindado asesoramiento t茅cnico como Profesor Ayudante en Duoc UC.\n"
      },
      "programming": {
        "programmingLanguages": "Lenguajes de programaci贸n",
        "databases": "Bases de datos",
        "technologiesTools": "Herramientas y tecnolog铆as",
        "methodologies": "Metodolog铆as",
        "cloudTechnologies": "Tecnolog铆as en la nube"
      },
      "libraries": "Librer铆as  y Frameworks"
    }
  },
  "projects": {
    "github": {
      "title": "Proyectos de Github"
    },
    "others": {
      "title": "Proyectos Recientes Publicados",
      "projects": [
        {
          "name": "Carbon Flama",
          "html_url": "https://carbonflama.cl",
          "description":"Sitio web creado para la venta de carb贸n por mayor, actualmente se encuentra en construcci贸n.\n",
          "image":"carbon-flama.png"
        }
      ]
    }
  },
  "settings": {
    "theme": {
      "default": "Claro",
      "dark": "Oscuro"
    },
      "language": {
        "title": "Idioma Cambiado",
        "description": "El idioma ha sido cambiado exitosamente"
      }    
  }
}